#+TITLE: Chapter 1
#+AUTHOR: Arian Dehghani
#+OPTIONS: num:nil
Programmers writing programs are like wizards conjuring
spells. Learning programming is not dangerous, but real-world
programming can be bad, because just like novice wizards, programmers
can make things go boom.

Lisp is one of the oldest languages that has survived (the other being
Fortran). Computational processes and data are both lists, so the
distinction that occurs in other languages is kind of blurry
here. This allows you to manipulate the data and procedures as a
similar thing. 

Scheme is the dialect that this book uses. It's nice. Guy Steele and
Gerald Sussman are the masterminds behind it. The first IEEE standard
appeared in 1990. Common lisp also added some of its features later
on.
** 1.1.1 Expressions
The first element, the primitive unit, is easy to use at the repl
(read-evaluate-print-loop). You just do
#+begin_src scheme :exports both
420
#+end_src

#+RESULTS:
: 420
It gives the number back. You just wrote an /expression/ and the repl
/evaluated/ it. 

For application of procedures, you write the second element:
combination. For that, you need the /operator/ (function, method,
procedure, etc) and /operands/ (argument, parameter, etc). For example
you can do multiplication with
#+begin_src scheme :exports both
(* 420 69)
#+end_src

#+RESULTS:
: 28980

There are advantages to this /prefix/ notation:
1) You can have an arbitrary number of operands
2) There is no ambiguity
3) Easily nested structures

We can write something like
#+begin_src scheme :exports both
(+ 1 2 (* 3 (/ 4 (- 5 4)) 3) 2 1 69)
#+end_src

#+RESULTS:
: 111

There is no ambiguity for the computer, but the humans need to
understand it better. Thanks to our dear friend emacs, we can write
the same thing as
#+begin_src scheme :exports both
(+ 1 2
   (* 3
      (/ 4
	 (- 5 4))
      3)
   2 1 69)
#+end_src

#+RESULTS:
: 111

which is much clearer.

Last thing to mention is that the repl doesn't require you to tell it
to print out the value; it does it for you. That's the beauty of repl.
** 1.1.2 Naming and Environment
Now we get to the third and last element, which is abstraction. The
simplest form of abstraction is naming values. For example you can set
the value of a number and see the result in a repl with
#+begin_src scheme :exports both
(define n 42)
n
#+end_src

#+RESULTS:
: 42

you can also use this to define variables from variables, or other
forms of expressions. One fairly important thing the book mentions is
that these variables are stored in memory, and they're specifically in
the /global environment/. We'll learn abour more in chapter 3.

Here are some math refreshers from high school.
- Area and perimeter of a square
#+begin_src scheme
(define side 10)
(define area (* side side))
(define perimeter (* 4 side))
#+end_src
- Area of a triangle
#+begin_src scheme :exports both
(define base 20)
(define height (/ 10))
(define area (/ (* base height) 2))
area
#+end_src

#+RESULTS:
: 1

- Pythagorean theroem

#+begin_src scheme :exports both
(define a 3)
(define b 4)
(define c (sqrt (+ (* a a) (* b b))))
c
#+end_src

#+RESULTS:
: 5
** 1.1.4 Compound procedures
In scheme, they call functions procedures. They have an easy syntax:
#+begin_src
(define (<name> <bunch of params>) (<body>))
#+end_src
Name is the name of the function. Notice that the definition looks
just as if you called the function (not the case in common lisp). Then
you have the parameters (called formal parameters in the book), and
finally, the body. The body is either an expression, or a series of
expressions, in which case the last expression is returned.
The book uses square and sum of squares as example
#+begin_src scheme :exports both
  (define (square x) (* x x))
  (define (sum-of-squares x y) (+ (square x) (square y)))
  (sum-of-squares 3 4)
#+end_src

#+RESULTS:
: 25

This makes it easy to define and call compound procedures. Let me do a
simple example:

#+begin_src scheme :exports both
(define (area-of-triangle base height) (* 1/2 base height))
(area-of-triangle 2 10)
#+end_src

#+RESULTS:
: 10

Note: The ~1/2~ is a unit, not a division. You can also one of the
following:

#+begin_src scheme
(define (area-of-triangle base height) (* (/ 1 2) base height))
(define (area-of-triangle base height) (* (/ base 2) height))
(define (area-of-triangle base height) (/ (* base height) 2))
#+end_src
